/*================================================================================
 * Copyright (C) 2020-2030  All Rights Reserved
 * 积成电子股份有限公司
 * 元件名称：中间标志元件
 * 元件功能：中间标志元件
 *     1.中间标志合成
 *     2.中间标志转换
 * 元件版本：V1.00
 * 定版时间：2020-9-7
 * 版本修改：
 * <版本号> <修改日期>, <修改人员>: <修改功能概述>
 * V1.00 2021-2-24 刘志利：初版
 *================================================================================*/

#ifndef _IES_IMFLAG_H_
#define _IES_IMFLAG_H_

#include "IES_IMSrc.h"
// 元件接口结构体
typedef struct
{
	BYTE            byRamScan1;
	UINT32          dwInit;         // 组件复归标志
	UINT32          dwPWInit;       // 上电初始化标志
	UINT32          dwResetCnt;     // 复归返回计数
	BYTE            byRamScan2;
} tagIES_IMFlag;

/*================================================================================*/
// 元件接口全局函数
/*================================================================================*/
extern  void    IES_IMFlag_Para_Init();
extern  void    IES_IMFlag_Init();
extern  void    IES_IMFlag();
/*================================================================================*/
#endif/*_IES_IMFLAG_H_*/

